{
    "AboutUs":"Speed Xerox in Chennai is one of the leading businesses in the Colour Photocopying Centres. Also known for Photocopying Centres, Printing Services, DTP Services, Book Binding Services, Brochure Printers, Visiting Card Designers, Lamination Services, Tamil Typing Services and much moreEstablished in the year 1996, Speed Xerox is a top player in the category Colour Photocopying Centres in the Chennai. This well-known establishment acts as a one-stop destination servicing customers both local and from other parts of Chennai. Over the course of its journey, this business has established a firm foothold in it’s industry. The belief that customer satisfaction is as important as their products and services, have helped this establishment garner a vast base of customers, which continues to grow by the day. This business employs individuals that are dedicated towards their respective roles and put in a lot of effort to achieve the common vision and larger goals of the company. In the near future, this business aims to expand its line of products and services and cater to a larger client base. In Chennai, this establishment occupies a prominent location in Porur. It is an effortless task in commuting to this establishment as there are various modes of transport readily available. It is at Trunk Poonamallee Road, Near to Porur Signal, which makes it easy for first-time visitors in locating this establishment. It is known to provide top service in the following categories: Photocopying Centres, Printing Services, DTP Services, Book Binding Services, Brochure Printers, Visiting Card Designers, Lamination Services, Tamil Typing Services.Speed Xerox in Porur has a wide range of products and / or services to cater to the varied requirements of their customers. The staff at this establishment are courteous and prompt at providing any assistance. They readily answer any queries or questions that you may have. Pay for the product or service with ease by using any of the available modes of payment, such as Cash, Credit Card, Visa Card, Master Card, Debit Cards, UPI, Paytm, G Pay, PhonePe. This establishment is functional from 09:00 - 21:00.",
    "Gallery":"Take a look on our Gallery",
    "Services":"Discover Speed Xerox's diverse range of services, including photocopying, printing, DTP services, book binding, brochure printing, visiting card designing, lamination, and more, delivering top-notch solutions to meet all your business and personal needs.",
    "Testimonial":"Here some our Client notes from Reviews",
    "ContactUs":"We are warmming to hear from you"
}